espressif/arduino-esp32/boards.txt
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

ticos-kit-aksu.name=Ticos Kit Aksu

ticos-kit-aksu.upload.tool=esptool_py
ticos-kit-aksu.upload.maximum_size=1310720
ticos-kit-aksu.upload.maximum_data_size=327680
ticos-kit-aksu.upload.flags=
ticos-kit-aksu.upload.extra_flags=

ticos-kit-aksu.serial.disableDTR=true
ticos-kit-aksu.serial.disableRTS=true

ticos-kit-aksu.build.tarch=xtensa
ticos-kit-aksu.build.bootloader_addr=0x1000
ticos-kit-aksu.build.target=esp32
ticos-kit-aksu.build.mcu=esp32
ticos-kit-aksu.build.core=esp32
ticos-kit-aksu.build.variant=ticos-kit-aksu
ticos-kit-aksu.build.board=ticos-kit-aksu
ticos-kit-aksu.build.f_cpu=240000000L
ticos-kit-aksu.build.boot=dio
ticos-kit-aksu.build.partitions=minimal
ticos-kit-aksu.build.flash_mode=dio
ticos-kit-aksu.build.flash_size=4MB
ticos-kit-aksu.build.flash_freq=40m
ticos-kit-aksu.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw

ticos-kit-aksu.menu.UploadSpeed.921600=921600
ticos-kit-aksu.menu.UploadSpeed.921600.upload.speed=921600
ticos-kit-aksu.menu.UploadSpeed.115200=115200
ticos-kit-aksu.menu.UploadSpeed.115200.upload.speed=115200
ticos-kit-aksu.menu.UploadSpeed.256000.windows=256000
ticos-kit-aksu.menu.UploadSpeed.256000.upload.speed=256000
ticos-kit-aksu.menu.UploadSpeed.230400.windows.upload.speed=256000
ticos-kit-aksu.menu.UploadSpeed.230400=230400
ticos-kit-aksu.menu.UploadSpeed.230400.upload.speed=230400
ticos-kit-aksu.menu.UploadSpeed.460800.linux=460800
ticos-kit-aksu.menu.UploadSpeed.460800.macosx=460800
ticos-kit-aksu.menu.UploadSpeed.460800.upload.speed=460800
ticos-kit-aksu.menu.UploadSpeed.512000.windows=512000
ticos-kit-aksu.menu.UploadSpeed.512000.upload.speed=512000

ticos-kit-aksu.menu.DebugLevel.none=None
ticos-kit-aksu.menu.DebugLevel.none.build.code_debug=0
ticos-kit-aksu.menu.DebugLevel.error=Error
ticos-kit-aksu.menu.DebugLevel.error.build.code_debug=1
ticos-kit-aksu.menu.DebugLevel.warn=Warn
ticos-kit-aksu.menu.DebugLevel.warn.build.code_debug=2
ticos-kit-aksu.menu.DebugLevel.info=Info
ticos-kit-aksu.menu.DebugLevel.info.build.code_debug=3
ticos-kit-aksu.menu.DebugLevel.debug=Debug
ticos-kit-aksu.menu.DebugLevel.debug.build.code_debug=4
ticos-kit-aksu.menu.DebugLevel.verbose=Verbose
ticos-kit-aksu.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

Ticos-kit-longan.name=Ticos Kit Longan
Ticos-kit-longan.vid.0=0x303a
Ticos-kit-longan.pid.0=0x1001

Ticos-kit-longan.bootloader.tool=esptool_py
Ticos-kit-longan.bootloader.tool.default=esptool_py

Ticos-kit-longan.upload.tool=esptool_py
Ticos-kit-longan.upload.tool.default=esptool_py
Ticos-kit-longan.upload.tool.network=esp_ota

Ticos-kit-longan.upload.maximum_size=1310720
Ticos-kit-longan.upload.maximum_data_size=327680
Ticos-kit-longan.upload.flags=
Ticos-kit-longan.upload.extra_flags=
Ticos-kit-longan.upload.use_1200bps_touch=false
Ticos-kit-longan.upload.wait_for_upload_port=false

Ticos-kit-longan.serial.disableDTR=false
Ticos-kit-longan.serial.disableRTS=false

Ticos-kit-longan.build.tarch=xtensa
Ticos-kit-longan.build.bootloader_addr=0x0
Ticos-kit-longan.build.target=esp32s3
Ticos-kit-longan.build.mcu=esp32s3
Ticos-kit-longan.build.core=esp32
Ticos-kit-longan.build.variant=esp32s3
Ticos-kit-longan.build.board=ESP32S3_DEV

Ticos-kit-longan.build.usb_mode=1
Ticos-kit-longan.build.cdc_on_boot=0
Ticos-kit-longan.build.msc_on_boot=0
Ticos-kit-longan.build.dfu_on_boot=0
Ticos-kit-longan.build.f_cpu=240000000L
Ticos-kit-longan.build.flash_size=4MB
Ticos-kit-longan.build.flash_freq=80m
Ticos-kit-longan.build.flash_mode=dio
Ticos-kit-longan.build.boot=qio
Ticos-kit-longan.build.partitions=default
Ticos-kit-longan.build.defines=
Ticos-kit-longan.build.loop_core=
Ticos-kit-longan.build.event_core=

Ticos-kit-longan.menu.LoopCore.1=Core 1
Ticos-kit-longan.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
Ticos-kit-longan.menu.LoopCore.0=Core 0
Ticos-kit-longan.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

Ticos-kit-longan.menu.EventsCore.1=Core 1
Ticos-kit-longan.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
Ticos-kit-longan.menu.EventsCore.0=Core 0
Ticos-kit-longan.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

Ticos-kit-longan.menu.USBMode.hwcdc=Hardware CDC and JTAG
Ticos-kit-longan.menu.USBMode.hwcdc.build.usb_mode=1
Ticos-kit-longan.menu.USBMode.default=USB-OTG
Ticos-kit-longan.menu.USBMode.default.build.usb_mode=0

Ticos-kit-longan.menu.CDCOnBoot.default=Disabled
Ticos-kit-longan.menu.CDCOnBoot.default.build.cdc_on_boot=0
Ticos-kit-longan.menu.CDCOnBoot.cdc=Enabled
Ticos-kit-longan.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

Ticos-kit-longan.menu.MSCOnBoot.default=Disabled
Ticos-kit-longan.menu.MSCOnBoot.default.build.msc_on_boot=0
Ticos-kit-longan.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
Ticos-kit-longan.menu.MSCOnBoot.msc.build.msc_on_boot=1

Ticos-kit-longan.menu.DFUOnBoot.default=Disabled
Ticos-kit-longan.menu.DFUOnBoot.default.build.dfu_on_boot=0
Ticos-kit-longan.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
Ticos-kit-longan.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

Ticos-kit-longan.menu.UploadMode.default=UART0
Ticos-kit-longan.menu.UploadMode.default.upload.use_1200bps_touch=false
Ticos-kit-longan.menu.UploadMode.default.upload.wait_for_upload_port=false
Ticos-kit-longan.menu.UploadMode.cdc=Internal USB
Ticos-kit-longan.menu.UploadMode.cdc.upload.use_1200bps_touch=true
Ticos-kit-longan.menu.UploadMode.cdc.upload.wait_for_upload_port=true

Ticos-kit-longan.menu.PSRAM.disabled=Disabled
Ticos-kit-longan.menu.PSRAM.disabled.build.defines=
Ticos-kit-longan.menu.PSRAM.enabled=Enabled
Ticos-kit-longan.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

Ticos-kit-longan.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Ticos-kit-longan.menu.PartitionScheme.default.build.partitions=default
Ticos-kit-longan.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Ticos-kit-longan.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Ticos-kit-longan.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
Ticos-kit-longan.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Ticos-kit-longan.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
Ticos-kit-longan.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Ticos-kit-longan.menu.PartitionScheme.minimal.build.partitions=minimal
Ticos-kit-longan.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Ticos-kit-longan.menu.PartitionScheme.no_ota.build.partitions=no_ota
Ticos-kit-longan.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Ticos-kit-longan.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Ticos-kit-longan.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Ticos-kit-longan.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Ticos-kit-longan.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Ticos-kit-longan.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Ticos-kit-longan.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Ticos-kit-longan.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Ticos-kit-longan.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Ticos-kit-longan.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Ticos-kit-longan.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Ticos-kit-longan.menu.PartitionScheme.huge_app.build.partitions=huge_app
Ticos-kit-longan.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Ticos-kit-longan.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Ticos-kit-longan.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Ticos-kit-longan.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Ticos-kit-longan.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
Ticos-kit-longan.menu.PartitionScheme.fatflash.build.partitions=ffat
Ticos-kit-longan.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
Ticos-kit-longan.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
Ticos-kit-longan.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
Ticos-kit-longan.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

Ticos-kit-longan.menu.CPUFreq.240=240MHz (WiFi)
Ticos-kit-longan.menu.CPUFreq.240.build.f_cpu=240000000L
Ticos-kit-longan.menu.CPUFreq.160=160MHz (WiFi)
Ticos-kit-longan.menu.CPUFreq.160.build.f_cpu=160000000L
Ticos-kit-longan.menu.CPUFreq.80=80MHz (WiFi)
Ticos-kit-longan.menu.CPUFreq.80.build.f_cpu=80000000L
Ticos-kit-longan.menu.CPUFreq.40=40MHz
Ticos-kit-longan.menu.CPUFreq.40.build.f_cpu=40000000L
Ticos-kit-longan.menu.CPUFreq.20=20MHz
Ticos-kit-longan.menu.CPUFreq.20.build.f_cpu=20000000L
Ticos-kit-longan.menu.CPUFreq.10=10MHz
Ticos-kit-longan.menu.CPUFreq.10.build.f_cpu=10000000L

Ticos-kit-longan.menu.FlashMode.qio=QIO
Ticos-kit-longan.menu.FlashMode.qio.build.flash_mode=dio
Ticos-kit-longan.menu.FlashMode.qio.build.boot=qio
Ticos-kit-longan.menu.FlashMode.dio=DIO
Ticos-kit-longan.menu.FlashMode.dio.build.flash_mode=dio
Ticos-kit-longan.menu.FlashMode.dio.build.boot=dio
Ticos-kit-longan.menu.FlashMode.qout=QOUT
Ticos-kit-longan.menu.FlashMode.qout.build.flash_mode=dout
Ticos-kit-longan.menu.FlashMode.qout.build.boot=qout
Ticos-kit-longan.menu.FlashMode.dout=DOUT
Ticos-kit-longan.menu.FlashMode.dout.build.flash_mode=dout
Ticos-kit-longan.menu.FlashMode.dout.build.boot=dout

Ticos-kit-longan.menu.FlashFreq.80=80MHz
Ticos-kit-longan.menu.FlashFreq.80.build.flash_freq=80m
Ticos-kit-longan.menu.FlashFreq.40=40MHz
Ticos-kit-longan.menu.FlashFreq.40.build.flash_freq=40m

Ticos-kit-longan.menu.FlashSize.4M=4MB (32Mb)
Ticos-kit-longan.menu.FlashSize.4M.build.flash_size=4MB
Ticos-kit-longan.menu.FlashSize.8M=8MB (64Mb)
Ticos-kit-longan.menu.FlashSize.8M.build.flash_size=8MB
Ticos-kit-longan.menu.FlashSize.8M.build.partitions=default_8MB
Ticos-kit-longan.menu.FlashSize.2M=2MB (16Mb)
Ticos-kit-longan.menu.FlashSize.2M.build.flash_size=2MB
Ticos-kit-longan.menu.FlashSize.2M.build.partitions=minimal
Ticos-kit-longan.menu.FlashSize.16M=16MB (128Mb)
Ticos-kit-longan.menu.FlashSize.16M.build.flash_size=16MB

Ticos-kit-longan.menu.UploadSpeed.921600=921600
Ticos-kit-longan.menu.UploadSpeed.921600.upload.speed=921600
Ticos-kit-longan.menu.UploadSpeed.115200=115200
Ticos-kit-longan.menu.UploadSpeed.115200.upload.speed=115200
Ticos-kit-longan.menu.UploadSpeed.256000.windows=256000
Ticos-kit-longan.menu.UploadSpeed.256000.upload.speed=256000
Ticos-kit-longan.menu.UploadSpeed.230400.windows.upload.speed=256000
Ticos-kit-longan.menu.UploadSpeed.230400=230400
Ticos-kit-longan.menu.UploadSpeed.230400.upload.speed=230400
Ticos-kit-longan.menu.UploadSpeed.460800.linux=460800
Ticos-kit-longan.menu.UploadSpeed.460800.macosx=460800
Ticos-kit-longan.menu.UploadSpeed.460800.upload.speed=460800
Ticos-kit-longan.menu.UploadSpeed.512000.windows=512000
Ticos-kit-longan.menu.UploadSpeed.512000.upload.speed=512000

Ticos-kit-longan.menu.DebugLevel.none=None
Ticos-kit-longan.menu.DebugLevel.none.build.code_debug=0
Ticos-kit-longan.menu.DebugLevel.error=Error
Ticos-kit-longan.menu.DebugLevel.error.build.code_debug=1
Ticos-kit-longan.menu.DebugLevel.warn=Warn
Ticos-kit-longan.menu.DebugLevel.warn.build.code_debug=2
Ticos-kit-longan.menu.DebugLevel.info=Info
Ticos-kit-longan.menu.DebugLevel.info.build.code_debug=3
Ticos-kit-longan.menu.DebugLevel.debug=Debug
Ticos-kit-longan.menu.DebugLevel.debug.build.code_debug=4
Ticos-kit-longan.menu.DebugLevel.verbose=Verbose
Ticos-kit-longan.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
